Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/extra_social_welfare_benefits/index.html.txt.tmx
Source language: en
Languages: ga

source: Extra social welfare benefits
ga: Sochair Leasa Shóisialaigh Bhreise

source: Overview Document Extra social welfare benefits Information about the extra benefits that may be available to certain people getting a social welfare payment
ga: Overview Document Sochair bhreise leasa shóisialaigh Tá móran sochair bhreise ar fáil do dhaoine áirithe a fhaigheann íocaíocht leasa shóisialaigh

source: Everyone aged 66 and over living permanently in Ireland is entitled to travel free of charge on public transport
ga: Tá gach uile dhuine aois 66 agus os cionn atá ina chónaí in Éirinn i dteideal taisteal ar iompar poiblí saor in aisce

source: People under 66 on certain social welfare payments are also entitled to free travel
ga: Tá daoine eile atá ag fáil íocaíochtaí áirithe leasa shóisialaigh i dteideal freisin

source: Find out more about free travel in Ireland and the Senior SmartPass which allows you to travel for free on public transport in Northern Ireland
ga: Faigh amach tuilleadh faoi shaorthaisteal in Éirinn agus faoin SmartPass Sinsearach a cheadaíonn duit taisteal ar iompar poiblí i dTuaisceart Éireann saor in aisce

source: Social welfare payments and living on a specified island
ga: Na híocaíochtaí leasa shóisialaigh le daoine a chónaíonn ar oileán sainithe

source: If you are getting a certain social welfare payment and living on a specified island off the coast of Ireland you can get an increase in your social welfare payment
ga: Má tá tú ag fáil íocaíocht leasa shóisialaigh sainithe agus tú i do chónaí ar oileáin áirithe amach ó chósta na hÉireann féadfaidh tú méadú a fháil ar d'íocaíocht leasa shóisialaigh

source: The Household Benefits Package helps you with the costs of running your household. It includes electricity and gas allowances and a Free Television Licence. It is paid to people over 70 and to people under 70 in some circumstances
ga: Tá cur síos sa cháipéis seo ar Liúntais don Líon Tí, an Liúntas Leictreachais, Liúntas Gáis Nádúrtha, Liúntas Leictreachais (Grúpchuntas) Liúntas ar Bhuidéal Gáis a Athlíonadh, Liúntas Teileafóin agus Ceadúnas Teilifíse in Aisce san áireamh

source: The Living Alone Increase is a supplementary payment for people on social welfare pensions who are living alone
ga: Tá cur síos anseo ar an Liúntas don Té a Chónaíonn ina (h)Aonar, íocaíocht bhreise do dhaoine a fhaigheann pinsin leasa shóisialaigh agus a chónaíonn ina n-aonair

source: The Smokeless Fuel Allowance was discontinued from September 2011
ga: Tá cosc curtha ar mhargaíocht, díolachán agus dáileadh an bhreosla is cúis le deatach i roinnt áiteanna sa tír

source: The National Fuel Scheme provides an allowance to low-income households that are unable to meet their heating needs
ga: Cur síos atá sa cháipéis seo ar an Scéim Náisiúnta Breosla, scéim a chuireann liúntas breosla ar fáil do líonta-tí ar ioncam íseal, nach bhfuil ábalta a riachtanais teasa a shásamh

source: Information about the Water Conservation Grant. The grant is currently suspended and is not available in 2016
ga: Faisnéis faoin Deontas Caomhnaithe Uisce a íocfar le teaghlaigh incháilithe in 2015

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
